title: Interpreter Executing Script From Temp Directory
id: sigma-025
status: stable
level: high
logsource:
  category: process_creation
detection:
  selection:
    ProcessName:
      - bash
      - sh
      - python
      - python3
      - perl
      - ruby
      - node
    exe|contains:
      - /tmp/
      - /var/tmp/
      - /dev/shm/
  condition: selection
tags:
  - attack.execution
  - attack.t1059
